# ConnectorManager Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectorManager Methods
ConnectorManager Class See Also
---
The ConnectorManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Lookup | Lookup the connector using the unique index value that identify this connector. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace